// =================================================
// Проверка поддержки Webp браузером
// =================================================
    import { isWebp } from "./function/isWebp.js";
    isWebp();
// =================================================
// Меню бургер
// =================================================
    import { burger } from "./function/burger.js";
    burger();
//==================================================
//Определяем устройство на котором открыта страница
//==================================================
    import { isMobilePack } from "./function/isMobile.js";
    isMobilePack();
// =================================================
// Шапка при скролле
// =================================================
    import { headerScroll } from "./function/headerScroll.js";
    headerScroll();
// =================================================
//Меню DropDown
// =================================================
    import { dropDown } from "./function/dropDown.js";
    dropDown();
// =================================================
//Анимация при скролле
// =================================================
    // import { animation } from "./function/animation.js";
    // animation();
// =================================================
//Модальные окна
// =================================================
    // import { popUp } from "./app/popup.js";
    // popUp();
// =================================================
//Динамический адаптив
// =================================================
    import { dynamicAdaptiv } from "./app/dynamicAdapt.js";
    dynamicAdaptiv();
// =================================================
//Динамический спойлер
// =================================================
    import { spoilers } from "./app/spoilers.js";
    spoilers();